macosx.org
* Proper PATH execution
  #+BEGIN_SRC emacs-lisp
    (defvar macos-required '(exec-path-from-shell))
    (package-initialize)

    ;; Check for installation requirement and install
    (if fresh-install
        (progn (package-refresh-contents)
               (dolist (p macos-required)
                 (when (not (package-installed-p p))
                   (package-install p)))))

    ;; env variables
    (exec-path-from-shell-copy-env "PYTHONPATH")
    (exec-path-from-shell-copy-env "PATH")
  #+END_SRC
* KeyMaps
  #+BEGIN_SRC emacs-lisp
    (message "Binding for MAC OS X")

    ;;OS Specific binds
    (setq mac-option-modifier 'meta)
    (setq mac-right-option-modifier 'control)
    (setq mac-control-modifier 'control)
    (setq mac-command-modifier 'alt)

    ;; prevent insertion of phi and other osx special characters
    (set-keyboard-coding-system nil)
  #+END_SRC
* Fonts
  Note that you do need the patched fonts to use this font
  #+BEGIN_SRC emacs-lisp
    (set-face-attribute 'default nil
                        :family "Inconsolata for Powerline" :height 130 :weight 'normal)
    (setq all-the-icons-default-adjust 0.0)
    (setq all-the-icons-scale-factor 0.9)
    ;; (setq powerline-text-scale-factor 1.0)
    ;; (setq spaceline-responsive nil)
    (setq powerline-image-apple-rgb t)
  #+END_SRC
* PDF-Tools
  #+BEGIN_SRC emacs-lisp
    ;;; Install epdfinfo via 'brew install pdf-tools' and then install the
    ;;; pdf-tools elisp via the use-package below. To upgrade the epdfinfo
    ;;; server, just do 'brew upgrade pdf-tools' prior to upgrading to newest
    ;;; pdf-tools package using Emacs package system. If things get messed
    ;;; up, just do 'brew uninstall pdf-tools', wipe out the elpa
    ;;; pdf-tools package and reinstall both as at the start.
    (use-package pdf-tools
      :ensure t
      :config
      (custom-set-variables
       '(pdf-tools-handle-upgrades nil)) ; Use brew upgrade pdf-tools instead.
      (setq pdf-info-epdfinfo-program "/usr/local/bin/epdfinfo"))
    (pdf-tools-install)
    (add-hook 'pdf-view-mode-hook 'auto-revert-mode)
    ;; Turn off evil mode for pdf tools
    (add-hook 'pdf-view-mode-hook '(lambda ()
                                     (turn-off-evil-mode)
                                     (turn-off-evil-mc-mode)))
     #+END_SRC
* Magit
  #+BEGIN_SRC emacs-lisp
    (setq magit-git-executable "/usr/local/Cellar/git/2.13.0/bin/git")
  #+END_SRC
